<template>
  <section>
    <div class="">
      <UICTabs
        class="lg:w-[601px] xl:w-[683px]"
        :content="true"
        v-model="setdef"
        :items="items"
      />
    </div>
  </section>
</template>

<script setup>
const items = ref([
  {
    label: "درباره من",
    value: "about",
    dis: `احتراما اینجانب   با 15 سال سابقه وکالت دادگستری (اسکودا) پذیرفته شده بعنوان رتبه 8 کانون وکلای خراسان رضوی آماده:
1️⃣ارائه مشاوره آنلاین و تلفنی در لحظه
2️⃣تنظیم دادخواست و شکوائیه
3️⃣تنظیم لایحه و اظهارنامه
4️⃣اعمال طرق فوق‌العاده بعد از قطعیت رای
در حوزه های تخصصی زیر به شما موکلین عزیز می باشم:
◀️حوزه دعاوی خانواده ‌‌‌
_طلاق توافقی؛ طلاق یکطرفه؛ -مطالبه و جهیزیه_مطالبه نفقه؛ مهریه وحضانت...
◀️ حوزه بیمه تامین اجتماعی؛ ادره کار
_مشاغل سخت و زیان آور _احتساب سابقه _بیمه بیکاری_اعتراض به مطالبات سازمان تأمین اجتماعی
‌‌◀️حوزه ملکی
_دعوای خلع ید_رفع تصرف عدوانی_الزام به تنظیم سند_روابط موجر و مستاجر_پیش‌فروش ساختمان _سرقفلی
◀️حوزه کیفری
_کلاهبرداری_فریب در ازدواج_خیانت در امانت_توهین و افتراء_تهدید_مزاحمت_رشاء و ارتشاء_اخاذی _شهادت دروغ
◀️حوزه قراردادها
مشارکت در ساخت؛ قرارداد کار موقت؛ قرارداد خرید و فروش؛ قرارداد مشارکت در تولید؛ قرارداد پیمانکاری
◀️حوزه جرایم اینترنتی وسایبری
کلاهبرداری اینترنتی؛ سایت های قمار و شرط‌بندی؛
◀️حوزه دعاوی چک و سفته`,
    iconTr: "hugeicons:user-account",
    slot: "about",
  },
  {
    label: "موقعیت ویکیل",
    value: "position",
    slot: "position",
  },
  {
    label: "زمان مشاوره",
    value: "visit",
    slot: "visit",
  },
]);

const setdef = ref(items.value[0].value);
</script>

<style>
</style>