<template>
  <div class="container">
    <h1 class="text-2xl font-bold">سلب مسئولیت:</h1>
    <p class="text-sm">
        اطلاعات این وب‌سایت به‌صورت خودکار و صرفاً از منابع عمومی و معتبر گردآوری شده است. این پلتفرم هیچ‌گونه وابستگی یا تأیید رسمی نسبت به اشخاص یا نهادهای ذکرشده ندارد و مسئولیتی در قبال صحت، به‌روزرسانی یا نتایج استفاده از اطلاعات منتشرشده بر عهده نمی‌گیرد. درخواست اصلاح یا حذف اطلاعات از طریق راه‌های ارتباطی قابل پیگیری است.
    </p>
  </div>
</template>

<script setup>
useHead({
  title: "حریم خصوصی | وکیل وکیل",
});
</script>