<template>
  <section id="faq">
    <h2 class="sec-header mb-2 lg:mb-3">سوالات متداول</h2>
    <UAccordion
      :items="faqItems"
      :ui="{
        root: 'space-y-2 lg:space-y-3',
        item: 'bg-white border border-b! border-gray-200  rounded-lg lg:rounded-xl overflow-hidden ',
        trigger: 'text-base px-3 py-4 lg:p-4 gap-3 lg:text-lg ',
        body: 'text-base p-3 bg-primary/12 whitespace-break-spaces',
      }"
    />
  </section>
</template>
<script setup>
const faqItems = [
  {
    label: "مدت زمان هر مشاوره چقدر است؟",
    content: `💠 مدت زمان مشاوره بسته به نوع خدمت انتخابی متفاوت است، اما معمولاً بین ۲۰ تا ۴۵ دقیقه زمان اختصاص داده می‌شود.

💠 در صورت نیاز به زمان بیشتر، امکان تمدید جلسه با هماهنگی وکیل وجود دارد.`,
  },
  {
    label: "چه مدارکی باید ارسال کنیم؟",
    content: `💠 هر نوع مدرک مرتبط با موضوع مشاوره، مانند قرارداد، نامه رسمی، پیامک‌ها یا تصاویر مدارک شناسایی می‌تواند مفید باشد.

💠 وکیل در صورت نیاز، لیست دقیق‌تری از مدارک را از شما درخواست خواهد کرد.`,
  },
  {
    label: "آیا امکان تغییر زمان مشاوره وجود دارد؟",
    content: `💠 بله، تا ۲ ساعت قبل از زمان تعیین‌شده، امکان تغییر یا لغو مشاوره از طریق پنل کاربری یا پشتیبانی وجود دارد.

💠 پس از آن، تغییر زمان فقط با تایید وکیل ممکن است.`,
  },
  {
    label: "در صورت نارضایتی از مشاوره چه باید کرد؟",
    content: `💠 در صورتی که از روند یا محتوای مشاوره رضایت نداشتید، می‌توانید موضوع را از طریق پشتیبانی پیگیری کرده و درخواست بررسی مجدد ثبت کنید.

💠 ما کیفیت خدمات و رضایت کاربران را در اولویت قرار می‌دهیم.`,
  },
];
</script>
<style scoped>
@reference "tailwindcss";
</style>