<template>
  <section id="visit-guide">
    <div class="guide-con bg-primary/5">
      <h2 class="sec-header mb-2 lg:mb-3">راهنمای ویزیت آنلاین</h2>
      <div class="space-y-2.5">
        <h2>
          <UIcon
            name="hugeicons:information-diamond"
            class="align-middle me-0.5 size-5!"
          />
          برای مشاهده جزئیات هر شیوه ویزیت روی آن کلیک کنید
        </h2>
        <div>
          <UICSelectButton
            v-model="visitType"
            :items="filteredVisitTypes"
            :ui="{
              base: 'text-black bg-white rounded-lg',
            }"
          />
        </div>
      </div>
      <hr class="text-gray-200" />
      <div class="space-y-2.5">
        <h2>در چت وکیل در فضای چت از طریق پیام به شما مشاوره می دهد</h2>
        <UAccordion
          :items="items"
          :ui="{
            root: 'space-y-2 lg:space-y-3',
            item: 'border-b-0 bg-white rounded-lg lg:rounded-xl overflow-hidden',
            trigger: 'text-base px-3 py-2.5 lg:p-3.5 gap-3 lg:text-lg ',
            body: 'text-base p-3 bg-primary/12 whitespace-break-spaces',
          }"
        >
          <template #leading="{ item }">
            <div class="size-9 lg:size-10 relative rounded-full bg-primary/12">
              <UIcon
                :name="item?.icon"
                class="absolute -translate-1/2 top-1/2 end-1/2 size-4.5! lg:size-5!"
              />
            </div>
          </template>
        </UAccordion>
      </div>
    </div>
    <div class="vector-con"></div>
  </section>
</template>
<script setup>
import { useFiltersStore } from '~/store/filters';

const { visitTypes } = useFiltersStore();

const filteredVisitTypes = visitTypes.filter((item) => item.id !== "inperson");
const visitType = ref(filteredVisitTypes[1].id);

const items = ref([
  {
    label: "ثبت درخواست ویزیت ",
    content: `💠 نوع خدمات حقوقی و وکیل مورد نظر خود را انتخاب کنید.

💠 در بخش شرح درخواست، موضوع مشکل حقوقی خود را به‌صورت کوتاه، دقیق و شفاف بنویسید.

💠 تاریخ و ساعت موردنظر برای مشاوره یا شروع گفت‌وگو را مشخص کنید.

💠 اگر دارای بیمه حقوقی یا قرارداد مشاوره‌ای هستید، اطلاعات مربوط را وارد نمایید.

💠 کد تخفیف دارید؟ وارد کرده و فعال‌سازی کنید.
`,
    icon: "solar:document-add-linear",
  },
  {
    label: "پرداخت موفق و انتظار",
    content: `💠 بعد از ثبت درخواست و پرداخت موفق، اطلاعات مربوط به پرونده حقوقی خود را تکمیل کنید.

💠 پس از تکمیل اطلاعات، امکان شروع گفت‌وگو با وکیل برای شما فعال می‌شود.

💠 در مشاوره متنی، پاسخ‌گویی حداکثر تا ۱۰ ساعت انجام می‌شود، اما بسیاری از وکلا زودتر پاسخ می‌دهند.

💠 میانگین زمان پاسخ‌گویی هر وکیل را در پروفایل او می‌توانید مشاهده کنید.
`,
    icon: "solar:wallet-money-outline",
  },
  {
    label: "نوع مشاوره: چت",
    content: `💠 وکیل پاسخ شما را در زمان مقرر، از طریق چت و به‌صورت متنی ارسال می‌کند.

💠 در صورت داشتن مستندات مرتبط مانند قرارداد، اظهارنامه، دادخواست یا سایر مدارک حقوقی، می‌توانید آن‌ها را در فضای چت برای وکیل ارسال کنید.`,
    icon: "solar:chat-line-linear",
  },
  {
    label: "خاتمه مشاوره",
    content: `💠 مشاوره حقوقی با هماهنگی شما و توسط وکیل پایان داده می‌شود.

💠 اگر مشاوره بدون اطلاع شما به پایان رسید، با پشتیبانی حقوقی ما تماس بگیرید.

💠 هر مشاوره باید روی یک موضوع مشخص حقوقی متمرکز باشد. برای طرح موضوع جدید، مشاوره‌ی جداگانه‌ای ثبت کنید.

💠 اطلاعات تمام مشاوره‌های شما در بخش «گفت‌وگوهای من» ذخیره می‌شود.

💠 نظرتان درباره مشاوره را ثبت کنید؛ این بازخورد به سایر کاربران در انتخاب بهتر وکیل کمک می‌کند.`,
    icon: "solar:alarm-outline",
  },
]);
</script>
<style scoped>
@reference "tailwindcss";
#visit-guide {
}
.guide-con {
  @apply rounded-2xl p-4 border border-gray-200 space-y-3;
}
</style>